studyapppw1/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <registerRecords>AccumulationRegister.СтоимостныеПоказатели</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.ГотоваяПродукция</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическоеКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьМатериалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщиеЗатратыНаПроизводство</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

studyapppw1/src/AccumulationRegisters/СтоимостныеПоказатели/СтоимостныеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостныеПоказатели</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ГотоваяПродукция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

studyapppw1/src/Documents/Производство/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.СтоимостныеПоказатели.Записывать = Истина;

    Если Продукт = Неопределено Тогда
        Отказ = Истина;
        Сообщить("Не указан продукт (продукция)!");
        Возврат;
    КонецЕсли;

    Если ФактическоеКоличество = Неопределено Или ФактическоеКоличество <= 0 Тогда
        Отказ = Истина;
        Сообщить("Фактическое количество должно быть больше 0!");
        Возврат;
    КонецЕсли;
    Если ОбщиеЗатратыНаПроизводство = Неопределено Тогда
        ОбщиеЗатратыНаПроизводство = 0;
    КонецЕсли;

    СебестоимостьЕдиницы = 0;
    Если ФактическоеКоличество <> 0 Тогда
        СебестоимостьЕдиницы = ОбщиеЗатратыНаПроизводство / ФактическоеКоличество;
    КонецЕсли;

    Запись = Движения.СтоимостныеПоказатели.Добавить();
    Запись.Период = Дата;
    Запись.Продукция = Продукт;
    Запись.ЭтапПроизводства = ЭтапПроизводства;

    Запись.Себестоимость = СебестоимостьЕдиницы;
    Запись.ОбщаяСтоимость = ОбщиеЗатратыНаПроизводство;

КонецПроцедуры
